----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 28, 28]             640
       BatchNorm2d-2           [-1, 64, 28, 28]             128
              ReLU-3           [-1, 64, 28, 28]               0
         MaxPool2d-4           [-1, 64, 14, 14]               0
            Conv2d-5           [-1, 64, 14, 14]           4,160
       BatchNorm2d-6           [-1, 64, 14, 14]             128
              ReLU-7           [-1, 64, 14, 14]               0
            Conv2d-8           [-1, 96, 14, 14]           6,240
       BatchNorm2d-9           [-1, 96, 14, 14]             192
             ReLU-10           [-1, 96, 14, 14]               0
           Conv2d-11          [-1, 128, 14, 14]         110,720
      BatchNorm2d-12          [-1, 128, 14, 14]             256
             ReLU-13          [-1, 128, 14, 14]               0
           Conv2d-14           [-1, 16, 14, 14]           1,040
      BatchNorm2d-15           [-1, 16, 14, 14]              32
             ReLU-16           [-1, 16, 14, 14]               0
           Conv2d-17           [-1, 32, 14, 14]          12,832
      BatchNorm2d-18           [-1, 32, 14, 14]              64
             ReLU-19           [-1, 32, 14, 14]               0
        MaxPool2d-20           [-1, 64, 14, 14]               0
           Conv2d-21           [-1, 32, 14, 14]           2,080
      BatchNorm2d-22           [-1, 32, 14, 14]              64
             ReLU-23           [-1, 32, 14, 14]               0
  InceptionModule-24          [-1, 256, 14, 14]               0
           Conv2d-25          [-1, 128, 14, 14]          32,896
      BatchNorm2d-26          [-1, 128, 14, 14]             256
             ReLU-27          [-1, 128, 14, 14]               0
           Conv2d-28          [-1, 128, 14, 14]          32,896
      BatchNorm2d-29          [-1, 128, 14, 14]             256
             ReLU-30          [-1, 128, 14, 14]               0
           Conv2d-31          [-1, 192, 14, 14]         221,376
      BatchNorm2d-32          [-1, 192, 14, 14]             384
             ReLU-33          [-1, 192, 14, 14]               0
           Conv2d-34           [-1, 32, 14, 14]           8,224
      BatchNorm2d-35           [-1, 32, 14, 14]              64
             ReLU-36           [-1, 32, 14, 14]               0
           Conv2d-37           [-1, 96, 14, 14]          76,896
      BatchNorm2d-38           [-1, 96, 14, 14]             192
             ReLU-39           [-1, 96, 14, 14]               0
        MaxPool2d-40          [-1, 256, 14, 14]               0
           Conv2d-41           [-1, 64, 14, 14]          16,448
      BatchNorm2d-42           [-1, 64, 14, 14]             128
             ReLU-43           [-1, 64, 14, 14]               0
  InceptionModule-44          [-1, 480, 14, 14]               0
        MaxPool2d-45            [-1, 480, 7, 7]               0
AdaptiveAvgPool2d-46            [-1, 480, 1, 1]               0
          Dropout-47                  [-1, 480]               0
           Linear-48                   [-1, 10]           4,810
================================================================
Total params: 533,402
Trainable params: 533,402
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 7.53
Params size (MB): 2.03
Estimated Total Size (MB): 9.57
----------------------------------------------------------------
