----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 32, 32]           1,792
       BatchNorm2d-2           [-1, 64, 32, 32]             128
              ReLU-3           [-1, 64, 32, 32]               0
         MaxPool2d-4           [-1, 64, 16, 16]               0
            Conv2d-5           [-1, 64, 16, 16]           4,160
       BatchNorm2d-6           [-1, 64, 16, 16]             128
              ReLU-7           [-1, 64, 16, 16]               0
            Conv2d-8           [-1, 96, 16, 16]           6,240
       BatchNorm2d-9           [-1, 96, 16, 16]             192
             ReLU-10           [-1, 96, 16, 16]               0
           Conv2d-11          [-1, 128, 16, 16]         110,720
      BatchNorm2d-12          [-1, 128, 16, 16]             256
             ReLU-13          [-1, 128, 16, 16]               0
           Conv2d-14           [-1, 16, 16, 16]           1,040
      BatchNorm2d-15           [-1, 16, 16, 16]              32
             ReLU-16           [-1, 16, 16, 16]               0
           Conv2d-17           [-1, 32, 16, 16]          12,832
      BatchNorm2d-18           [-1, 32, 16, 16]              64
             ReLU-19           [-1, 32, 16, 16]               0
        MaxPool2d-20           [-1, 64, 16, 16]               0
           Conv2d-21           [-1, 32, 16, 16]           2,080
      BatchNorm2d-22           [-1, 32, 16, 16]              64
             ReLU-23           [-1, 32, 16, 16]               0
  InceptionModule-24          [-1, 256, 16, 16]               0
           Conv2d-25          [-1, 128, 16, 16]          32,896
      BatchNorm2d-26          [-1, 128, 16, 16]             256
             ReLU-27          [-1, 128, 16, 16]               0
           Conv2d-28          [-1, 128, 16, 16]          32,896
      BatchNorm2d-29          [-1, 128, 16, 16]             256
             ReLU-30          [-1, 128, 16, 16]               0
           Conv2d-31          [-1, 192, 16, 16]         221,376
      BatchNorm2d-32          [-1, 192, 16, 16]             384
             ReLU-33          [-1, 192, 16, 16]               0
           Conv2d-34           [-1, 32, 16, 16]           8,224
      BatchNorm2d-35           [-1, 32, 16, 16]              64
             ReLU-36           [-1, 32, 16, 16]               0
           Conv2d-37           [-1, 96, 16, 16]          76,896
      BatchNorm2d-38           [-1, 96, 16, 16]             192
             ReLU-39           [-1, 96, 16, 16]               0
        MaxPool2d-40          [-1, 256, 16, 16]               0
           Conv2d-41           [-1, 64, 16, 16]          16,448
      BatchNorm2d-42           [-1, 64, 16, 16]             128
             ReLU-43           [-1, 64, 16, 16]               0
  InceptionModule-44          [-1, 480, 16, 16]               0
        MaxPool2d-45            [-1, 480, 8, 8]               0
AdaptiveAvgPool2d-46            [-1, 480, 1, 1]               0
          Dropout-47                  [-1, 480]               0
           Linear-48                   [-1, 10]           4,810
================================================================
Total params: 534,554
Trainable params: 534,554
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 9.84
Params size (MB): 2.04
Estimated Total Size (MB): 11.89
----------------------------------------------------------------
