----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 28, 28]             640
       BatchNorm2d-2           [-1, 64, 28, 28]             128
              ReLU-3           [-1, 64, 28, 28]               0
            Conv2d-4           [-1, 64, 28, 28]          36,928
       BatchNorm2d-5           [-1, 64, 28, 28]             128
              ReLU-6           [-1, 64, 28, 28]               0
         MaxPool2d-7           [-1, 64, 14, 14]               0
            Conv2d-8          [-1, 128, 14, 14]          73,856
       BatchNorm2d-9          [-1, 128, 14, 14]             256
             ReLU-10          [-1, 128, 14, 14]               0
           Conv2d-11          [-1, 128, 14, 14]         147,584
      BatchNorm2d-12          [-1, 128, 14, 14]             256
             ReLU-13          [-1, 128, 14, 14]               0
        MaxPool2d-14            [-1, 128, 7, 7]               0
           Conv2d-15            [-1, 256, 7, 7]         295,168
      BatchNorm2d-16            [-1, 256, 7, 7]             512
             ReLU-17            [-1, 256, 7, 7]               0
           Conv2d-18            [-1, 256, 7, 7]         590,080
      BatchNorm2d-19            [-1, 256, 7, 7]             512
             ReLU-20            [-1, 256, 7, 7]               0
           Conv2d-21            [-1, 256, 7, 7]         590,080
      BatchNorm2d-22            [-1, 256, 7, 7]             512
             ReLU-23            [-1, 256, 7, 7]               0
        MaxPool2d-24            [-1, 256, 3, 3]               0
           Conv2d-25            [-1, 512, 3, 3]       1,180,160
      BatchNorm2d-26            [-1, 512, 3, 3]           1,024
             ReLU-27            [-1, 512, 3, 3]               0
           Conv2d-28            [-1, 512, 3, 3]       2,359,808
      BatchNorm2d-29            [-1, 512, 3, 3]           1,024
             ReLU-30            [-1, 512, 3, 3]               0
           Conv2d-31            [-1, 512, 3, 3]       2,359,808
      BatchNorm2d-32            [-1, 512, 3, 3]           1,024
             ReLU-33            [-1, 512, 3, 3]               0
        MaxPool2d-34            [-1, 512, 1, 1]               0
           Conv2d-35            [-1, 512, 1, 1]       2,359,808
      BatchNorm2d-36            [-1, 512, 1, 1]           1,024
             ReLU-37            [-1, 512, 1, 1]               0
           Conv2d-38            [-1, 512, 1, 1]       2,359,808
      BatchNorm2d-39            [-1, 512, 1, 1]           1,024
             ReLU-40            [-1, 512, 1, 1]               0
           Conv2d-41            [-1, 512, 1, 1]       2,359,808
      BatchNorm2d-42            [-1, 512, 1, 1]           1,024
             ReLU-43            [-1, 512, 1, 1]               0
AdaptiveAvgPool2d-44            [-1, 512, 1, 1]               0
           Linear-45                 [-1, 4096]       2,101,248
             ReLU-46                 [-1, 4096]               0
          Dropout-47                 [-1, 4096]               0
           Linear-48                 [-1, 4096]      16,781,312
             ReLU-49                 [-1, 4096]               0
          Dropout-50                 [-1, 4096]               0
           Linear-51                   [-1, 10]          40,970
================================================================
Total params: 33,645,514
Trainable params: 33,645,514
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 5.01
Params size (MB): 128.35
Estimated Total Size (MB): 133.37
----------------------------------------------------------------
