----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 28, 28]             576
       BatchNorm2d-2           [-1, 64, 28, 28]             128
              ReLU-3           [-1, 64, 28, 28]               0
            Conv2d-4           [-1, 64, 28, 28]          36,864
       BatchNorm2d-5           [-1, 64, 28, 28]             128
              ReLU-6           [-1, 64, 28, 28]               0
            Conv2d-7           [-1, 64, 28, 28]          36,864
       BatchNorm2d-8           [-1, 64, 28, 28]             128
              ReLU-9           [-1, 64, 28, 28]               0
       BasicBlock-10           [-1, 64, 28, 28]               0
           Conv2d-11           [-1, 64, 28, 28]          36,864
      BatchNorm2d-12           [-1, 64, 28, 28]             128
             ReLU-13           [-1, 64, 28, 28]               0
           Conv2d-14           [-1, 64, 28, 28]          36,864
      BatchNorm2d-15           [-1, 64, 28, 28]             128
             ReLU-16           [-1, 64, 28, 28]               0
       BasicBlock-17           [-1, 64, 28, 28]               0
           Conv2d-18           [-1, 64, 28, 28]          36,864
      BatchNorm2d-19           [-1, 64, 28, 28]             128
             ReLU-20           [-1, 64, 28, 28]               0
           Conv2d-21           [-1, 64, 28, 28]          36,864
      BatchNorm2d-22           [-1, 64, 28, 28]             128
             ReLU-23           [-1, 64, 28, 28]               0
       BasicBlock-24           [-1, 64, 28, 28]               0
           Conv2d-25          [-1, 128, 14, 14]          73,728
      BatchNorm2d-26          [-1, 128, 14, 14]             256
             ReLU-27          [-1, 128, 14, 14]               0
           Conv2d-28          [-1, 128, 14, 14]         147,456
      BatchNorm2d-29          [-1, 128, 14, 14]             256
           Conv2d-30          [-1, 128, 14, 14]           8,192
      BatchNorm2d-31          [-1, 128, 14, 14]             256
             ReLU-32          [-1, 128, 14, 14]               0
       BasicBlock-33          [-1, 128, 14, 14]               0
           Conv2d-34          [-1, 128, 14, 14]         147,456
      BatchNorm2d-35          [-1, 128, 14, 14]             256
             ReLU-36          [-1, 128, 14, 14]               0
           Conv2d-37          [-1, 128, 14, 14]         147,456
      BatchNorm2d-38          [-1, 128, 14, 14]             256
             ReLU-39          [-1, 128, 14, 14]               0
       BasicBlock-40          [-1, 128, 14, 14]               0
           Conv2d-41          [-1, 128, 14, 14]         147,456
      BatchNorm2d-42          [-1, 128, 14, 14]             256
             ReLU-43          [-1, 128, 14, 14]               0
           Conv2d-44          [-1, 128, 14, 14]         147,456
      BatchNorm2d-45          [-1, 128, 14, 14]             256
             ReLU-46          [-1, 128, 14, 14]               0
       BasicBlock-47          [-1, 128, 14, 14]               0
           Conv2d-48          [-1, 128, 14, 14]         147,456
      BatchNorm2d-49          [-1, 128, 14, 14]             256
             ReLU-50          [-1, 128, 14, 14]               0
           Conv2d-51          [-1, 128, 14, 14]         147,456
      BatchNorm2d-52          [-1, 128, 14, 14]             256
             ReLU-53          [-1, 128, 14, 14]               0
       BasicBlock-54          [-1, 128, 14, 14]               0
           Conv2d-55            [-1, 256, 7, 7]         294,912
      BatchNorm2d-56            [-1, 256, 7, 7]             512
             ReLU-57            [-1, 256, 7, 7]               0
           Conv2d-58            [-1, 256, 7, 7]         589,824
      BatchNorm2d-59            [-1, 256, 7, 7]             512
           Conv2d-60            [-1, 256, 7, 7]          32,768
      BatchNorm2d-61            [-1, 256, 7, 7]             512
             ReLU-62            [-1, 256, 7, 7]               0
       BasicBlock-63            [-1, 256, 7, 7]               0
           Conv2d-64            [-1, 256, 7, 7]         589,824
      BatchNorm2d-65            [-1, 256, 7, 7]             512
             ReLU-66            [-1, 256, 7, 7]               0
           Conv2d-67            [-1, 256, 7, 7]         589,824
      BatchNorm2d-68            [-1, 256, 7, 7]             512
             ReLU-69            [-1, 256, 7, 7]               0
       BasicBlock-70            [-1, 256, 7, 7]               0
           Conv2d-71            [-1, 256, 7, 7]         589,824
      BatchNorm2d-72            [-1, 256, 7, 7]             512
             ReLU-73            [-1, 256, 7, 7]               0
           Conv2d-74            [-1, 256, 7, 7]         589,824
      BatchNorm2d-75            [-1, 256, 7, 7]             512
             ReLU-76            [-1, 256, 7, 7]               0
       BasicBlock-77            [-1, 256, 7, 7]               0
           Conv2d-78            [-1, 256, 7, 7]         589,824
      BatchNorm2d-79            [-1, 256, 7, 7]             512
             ReLU-80            [-1, 256, 7, 7]               0
           Conv2d-81            [-1, 256, 7, 7]         589,824
      BatchNorm2d-82            [-1, 256, 7, 7]             512
             ReLU-83            [-1, 256, 7, 7]               0
       BasicBlock-84            [-1, 256, 7, 7]               0
           Conv2d-85            [-1, 256, 7, 7]         589,824
      BatchNorm2d-86            [-1, 256, 7, 7]             512
             ReLU-87            [-1, 256, 7, 7]               0
           Conv2d-88            [-1, 256, 7, 7]         589,824
      BatchNorm2d-89            [-1, 256, 7, 7]             512
             ReLU-90            [-1, 256, 7, 7]               0
       BasicBlock-91            [-1, 256, 7, 7]               0
           Conv2d-92            [-1, 256, 7, 7]         589,824
      BatchNorm2d-93            [-1, 256, 7, 7]             512
             ReLU-94            [-1, 256, 7, 7]               0
           Conv2d-95            [-1, 256, 7, 7]         589,824
      BatchNorm2d-96            [-1, 256, 7, 7]             512
             ReLU-97            [-1, 256, 7, 7]               0
       BasicBlock-98            [-1, 256, 7, 7]               0
           Conv2d-99            [-1, 512, 4, 4]       1,179,648
     BatchNorm2d-100            [-1, 512, 4, 4]           1,024
            ReLU-101            [-1, 512, 4, 4]               0
          Conv2d-102            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-103            [-1, 512, 4, 4]           1,024
          Conv2d-104            [-1, 512, 4, 4]         131,072
     BatchNorm2d-105            [-1, 512, 4, 4]           1,024
            ReLU-106            [-1, 512, 4, 4]               0
      BasicBlock-107            [-1, 512, 4, 4]               0
          Conv2d-108            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-109            [-1, 512, 4, 4]           1,024
            ReLU-110            [-1, 512, 4, 4]               0
          Conv2d-111            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-112            [-1, 512, 4, 4]           1,024
            ReLU-113            [-1, 512, 4, 4]               0
      BasicBlock-114            [-1, 512, 4, 4]               0
          Conv2d-115            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-116            [-1, 512, 4, 4]           1,024
            ReLU-117            [-1, 512, 4, 4]               0
          Conv2d-118            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-119            [-1, 512, 4, 4]           1,024
            ReLU-120            [-1, 512, 4, 4]               0
      BasicBlock-121            [-1, 512, 4, 4]               0
AdaptiveAvgPool2d-122            [-1, 512, 1, 1]               0
          Linear-123                   [-1, 10]           5,130
================================================================
Total params: 21,280,970
Trainable params: 21,280,970
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 20.58
Params size (MB): 81.18
Estimated Total Size (MB): 101.77
----------------------------------------------------------------
